#### Data set contains information of price, transmission, mileage, fuel type, road tax, miles per gallon (mpg), and engine size

In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

import os
import glob

In [54]:
df=pd.read_csv('data/final/merge.csv')
df.head()

  model    year  price transmission mileage
0    A1  2017.0  12500       Manual   15735
1    A6  2016.0  16500    Automatic   36203
2    A1  2016.0  11000       Manual   29946
3    A4  2017.0  16800    Automatic   25952
4    A3  2019.0  17300       Manual    1998

In [61]:
all_model = os.listdir('./data')

all_brands = []
for each in all_model[0:12]:
    all_brands.append(each.split('.')[0])

In [62]:
path = 'data/'
#all_files = glob.glob(path + "/*.csv")

li = {}
for each in all_brands[1:12]:
    filename = path + each + ".csv"
    df1 = pd.read_csv(filename)['model'].unique()
    li[each] = df1

In [92]:
for i in li.keys():
    for each in li[i]:
        if each in df['model']:
            print(each)

In [93]:
df.head()

  model    year  price transmission mileage
0    A1  2017.0  12500       Manual   15735
1    A6  2016.0  16500    Automatic   36203
2    A1  2016.0  11000       Manual   29946
3    A4  2017.0  16800    Automatic   25952
4    A3  2019.0  17300       Manual    1998